# --- Этап 1: Сборка проекта с помощью Maven ---
FROM maven:3.8.5-openjdk-17-slim AS build

# Устанавливаем рабочую директорию
WORKDIR /app

# Копируем pom.xml и загружаем зависимости.
# Это кэширует слой с зависимостями, если они не менялись.
COPY pom.xml .
RUN mvn dependency:go-offline

# Копируем исходный код
COPY src ./src

# Собираем приложение, пропуская тесты
RUN mvn clean package -DskipTests


# --- Этап 2: Запуск приложения на легковесном образе ---
FROM openjdk:17-slim

# Устанавливаем рабочую директорию
WORKDIR /app

# Копируем собранный .jar файл из этапа сборки
COPY --from=build /app/target/*.jar app.jar

# Указываем порт, который слушает наше приложение (для документации)
EXPOSE 8080

# Команда для запуска приложения
# Приложение будет использовать переменные окружения, переданные при запуске контейнера
ENTRYPOINT ["java", "-jar", "app.jar"]